# Term Project Spring 2020 - Team Game Cancelled
___

## Course Data Tests
_Test the integrity of your new CourseData.db database._

<b> Table of Contents: </b>
<br> [1. Set Up - SQL and Database](#00)
<br> [2. Test Domain Integrity for Each Column](#10)
<br> [3. Test Integrity of Each Row](#20)
<br> [4. Test Integrity of Each Table Relationship](#30)
<br> [5. Empty out Tables to Reclaim Storage](#40)

___

<a id = "00"> <h2> 1. Set Up - SQL and Database </h2> </a>

### Imports

In [1]:
%load_ext sql
import pandas as pd
import sqlite3

In [2]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

___
<a id = "10"> <h2> 2. Test Domain Integrity for Each Column </h2> </a>
_Each column has a sensible data type (Domain integrity)_

In [3]:
%%sql 
-- Testing Instructors Table

SELECT *
FROM Instructors
LIMIT 10

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos'),
 (6, 'Scott M  Brenner'),
 (7, 'Kevin C.  Cassidy'),
 (8, 'Bruce   Bradford'),
 (9, 'Milo W.  Peck'),
 (10, 'Stephen E.  Yost')]

In [4]:
%%sql 
-- Testing Programs Table

SELECT *
FROM Programs
LIMIT 10

 * sqlite:///CourseData.db
Done.

[(1, 'AC', 'Accounting'),
 (2, 'AE', 'Applied Ethics'),
 (3, 'AH', 'Art History'),
 (4, 'AN', 'Asian Studies'),
 (5, 'AR', 'Arabic'),
 (6, 'AS', 'American Studies'),
 (7, 'AY', 'Anthropology'),
 (8, 'BB', 'Business'),
 (9, 'BEN', 'Bioengineering'),
 (10, 'BI', 'Biology')]

In [5]:
%%sql 
-- Testing Course Catalogs Table

SELECT *
FROM Course_Catalogs
LIMIT 2

 * sqlite:///CourseData.db
Done.

[(1, '2017_2018', 'AN 0301', '4', 'Independent Study', '1-3 Credits', None, None, None, None, 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.'),
 (2, '2017_2018', 'AN 0310', '4', 'Asian Studies Seminar', '3 Credits', None, None, None, None, 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.')]

_Take aways:_ 
- Data is truncated in the "Description" section of Course_Catalog Table
- Independent Study is 3.000 Credits in Course_Offerings Table & Timecodes are '[]'

In [6]:
%%sql 
-- Testing Course Offerings Table

SELECT *
FROM COURSE_OFFERINGS
WHERE CatalogID = 'AN 0301'

 * sqlite:///CourseData.db
Done.

[(96, None, 'Fall2014', 71858, 'AN 0301', 'A', '3.000', 'Independent Study 201409', '[]', 'TBA', 0, 0, 0),
 (1615, None, 'Fall2015', 77054, 'AN 0301', 'AA', '3.000', 'Independent Study', '[]', 'Anna-Maria   Aksan', 0, 1, -1),
 (3090, None, 'Fall2016', 79199, 'AN 0301', 'JX', '3.000', 'Independent Study: Tutorials for Advanced Chinese', '[]', 'Jiwei   Xiao', 0, 2, -2),
 (4585, None, 'Fall2017', 73057, 'AN 0301', 'DL', '3.000', 'Independent Study', '[]', 'Danke   Li', 0, 1, -1),
 (4586, None, 'Fall2017', 73018, 'AN 0301', 'JX', '3.000', 'Independent Study', '[]', 'Jiwei   Xiao', 0, 1, -1),
 (7591, None, 'Spring2015', 34130, 'AN 0301', 'DL', '3.000', 'Independent Study', '[]', 'Danke   Li', 1, 0, 1),
 (9007, None, 'Spring2016', 39186, 'AN 0301', 'PL', '3.000', 'Independent Study', '[]', 'Philip J.  Lane', 0, 1, -1)]

In [7]:
%%sql 
-- Testing Course Offerings Table

SELECT *
FROM Course_Offerings
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, None, 'Fall2014', 70384, 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31),
 (2, None, 'Fall2014', 70385, 'AC 0011', 'C02', '3.000', 'Introduction to Financial Accounting', "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31),
 (3, None, 'Fall2014', 70382, 'AC 0011', 'C03', '3.000', 'Introduction to Financial Accounting', "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31),
 (4, None, 'Fall2014', 70291, 'AC 0011', 'C04', '3.000', 'Introduction to Financial Accounting', "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch', 0, 29, -29),
 (5, None, 'Fall2014', 70350, 'AC 0011', 'C05', '3.000', 'Introduction to Financial Accounting', "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 'Rebecca I.  Bloch', 0, 30, -30)]

In [8]:
%%sql 
-- Testing Location Table

SELECT *
FROM Location
LIMIT 5

 * sqlite:///CourseData.db
Done.

[('BCC 200',), ('BD ',), ('BH ',), ('BH BY ARR',), ('BLM 112',)]

In [9]:
%%sql 
-- Testing Course Meetings Table

SELECT *
FROM Course_Meetings
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (2, 70384, 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (3, 70384, 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (4, 70384, 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (5, 70384, 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00')]

___
<a id = "20"> <h2> 3. Test Integrity of Each Row </h2> </a>

_Each row describes a unique entity (Entity integrity)_

In [10]:
%%sql
-- Record Counts for Course Meetings
SELECT 
    (SELECT Count(*) FROM IMPORT_COURSE_MEETINGS) as 'RawCount',
    (SELECT Count(*) FROM (SELECT DISTINCT * FROM IMPORT_COURSE_MEETINGS)) as 'DistinctCount';

 * sqlite:///CourseData.db
Done.

[(284907, 284847)]

In [11]:
## ADD NOTES HERE WITH WHAT WE'RE DOING - still need to resolve this 4/22

In [12]:
%%sql
SELECT 
    (SELECT Count(*) FROM COURSE_CATALOGS) as CatalogCourses,
    (SELECT Count(*) FROM COURSE_OFFERINGS) as CourseOfferings,
    (SELECT Count(*) FROM COURSE_MEETINGS) as CourseMeetings;

 * sqlite:///CourseData.db
Done.

[(4440, 15937, 284847)]

___
<a id = "30"> <h2> 4. Test Integrity of Each Table Relationship </h2> </a>

_Testing the Relationship Between Course Meetings and Course Offerings_

In [13]:
%%sql
-- A check of the COURSE_MEETINGS --> COURSE_OFFERINGS relationship
SELECT Term, CourseID, Count(CourseMeetingID)
FROM COURSE_OFFERINGS 
    JOIN COURSE_MEETINGS USING (CRN)
    WHERE CRN = 39006 and Term = 'Spring2016';

 * sqlite:///CourseData.db
Done.

[('Spring2016', None, 37)]

_Testing the Relationship Between Course Meetings and Location_

In [14]:
%%sql
-- A check of the COURSE_MEETINGS --> Location
SELECT Location.LocationID, COUNT(CourseMeetingID), StartDateTime
FROM COURSE_MEETINGS 
    JOIN Location USING (LocationID)
    WHERE StartDateTime = '2014-09-02T08:00:00' and LocationID = 'DSB 105';

 * sqlite:///CourseData.db
Done.

[('DSB 105', 1, '2014-09-02T08:00:00')]

_Testing the Relationship Between Course Offerings and Instructors_

In [15]:
%%sql
-- A check of the COURSE_OFFERINGS --> Instructors

SELECT CourseID, Term, CRN, Section, Title, Actual, Capacity, Remaining, Instructors.Name, InstructorID
FROM COURSE_OFFERINGS
    LEFT JOIN INSTRUCTORS ON (COURSE_OFFERINGS.PrimaryInstructorID = Instructors.Name)
    WHERE Name like '%Huntley' and Term = 'Fall2014'  
    LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(None, 'Fall2014', 70369, 'E', 'Intro to Information Systems', 26, 25, -1, 'Christopher L.  Huntley', 272),
 (None, 'Fall2014', 73060, 'A', 'Fundamentals of Web Design', 26, 25, -1, 'Christopher L.  Huntley', 272),
 (None, 'Fall2014', 73061, 'A', 'Systems Design and Implementation', 16, 25, 9, 'Christopher L.  Huntley', 272)]

_Testing the Relationship Between Course Offerings and Catalogs_

In [18]:
%%sql 
-- A check of COURSE_OFFERINGS --> COURSE_CATALOGS

SELECT CatalogYear, ProgramID, CourseTitle, Fees, COURSE_OFFERINGS.Credits, Attributes, Description
FROM COURSE_OFFERINGS 
    JOIN COURSE_CATALOGS USING (CourseID) 
    LIMIT 5;

 * sqlite:///CourseData.db
Done.

[]

_Testing the Relationship Between Course Catalogs and Programs_

In [17]:
%%sql 
-- A check of COURSE_CATALOGS --> PROGRAMS 

SELECT CatalogYear, PROGRAMS.ProgramID, ProgramName, Fees, Attributes, Description
FROM COURSE_CATALOGS 
    JOIN PROGRAMS USING (ProgramID) 
    LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('2017_2018', 4, 'Asian Studies', None, None, 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.'),
 ('2017_2018', 4, 'Asian Studies', None, None, 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.'),
 ('2017_2018', 12, 'Business', None, None, 'This course examines the broad philosophical as well as practical nature and function of the legal system, and introduces students to the legal and s ... (171 characters truncated) ... ivil process, and regulatory areas such as employment discrimination, protection of the environment, and corporate governance and securities markets.'),
 ('2017_2018', 12, 'Business', None, 'EVME Environmental Studies Major Elective, EVPE Environmental Studies Elective, EVSS Environmental Studies: Social Science, MGEL Management: General Elective', 'This course surveys issues arising out of federal laws designed to protect the environment and manage resources. It considers in detail the role of t ... (298 characters truncated) ... t groups in shaping environmental policy, giving special attention to the impact of environmental regulation on business and private property rights.'),
 ('2017_2018', 12, 'Business', None, None, 'This course examines the components of common law contracts including the concepts of offer and acceptance, consideration, capacity and legality, ass ... (117 characters truncated) ...  the Uniform Commercial Code relating to leases, sales of goods, and warranties. The course also considers personal and real property, and bailments.')]

 ___
<a id = "40"> <h2> 5. Empty out Tables to Reclaim Storage </h2> </a>

In [82]:
%%sql
DELETE FROM IMPORT_CATALOG_COURSES;
DELETE FROM IMPORT_COURSE_OFFERINGS;
DELETE FROM IMPORT_COURSE_MEETINGS;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: IMPORT_CATALOG_COURSES
[SQL: DELETE FROM IMPORT_CATALOG_COURSES;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [83]:
%%sql
DROP TABLE IMPORT_CATALOG_COURSES;
DROP TABLE IMPORT_COURSE_OFFERINGS;
DROP TABLE IMPORT_COURSE_MEETINGS;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: IMPORT_CATALOG_COURSES
[SQL: DROP TABLE IMPORT_CATALOG_COURSES;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [84]:
%%sql
vacuum;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) attempt to write a readonly database
[SQL: vacuum;]
(Background on this error at: http://sqlalche.me/e/e3q8)